import { LinkButton } from "./components/test/link";
import { Navbar } from './components/Navbar';

export const Home = () => {
  const title: string = "ホーム画面";
  return (
    <>
    <div className="Home">
      <h1>{title}</h1>
      フッターに隠れる
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
      ああああああああああああああああああああああああああああああ
        <LinkButton text="お気に入り画面/Favorite" link="/favorite" />
        <LinkButton text="推薦画面/Recommend" link="/recommend" />
        <LinkButton text="Spotify認証画面/Auth" link="/auth" />
        <h3>ヘッダー</h3>
        <LinkButton text="Spotify認証/Auth" link="/auth" />
    <Navbar />
    </div>
    </>
  );
}
